public class Main {

  public static void main(String[] args) {

    //Задача
//   программа, в которой можно будет прочитать отредактироватть
//   и вывест на экран иои сохранить в файл базу данных с товарами
//   Для кадлого товара необзодимр знать:
//   артикул уникальная строка
//   название строка
//   стоиомсть спец класс деньги

    //

    System.out.println("Hello world!");
  }
}