public class Main {

  public static void main(String[] args) {

// - геттеры и сеттеры
    // - файл Main
    // - взаимоотношения классов
    // - циклы

    // Задача:
    // программа, в которой можно будет прочитать, отредактировать и вывести на экран
    // или сохранить в файл базу данных с товарами.
    // Для каждого товара необходимо знать следующие вещи:
    // артикул - уникальная строка
    // название - строка
    // стоимость - специальный класс Деньги

    // Схема решения задачи:
    // 1. определяем, какие классы нам необходимы
    //  класс Item ля товара
    //  класс Money для денежных сумм
    // 1.1 Определяем поля каждого класса.
    //  Определяем необходимые методы.
    //  Определить схему использования этих методов в Мейн
    //  либо сразу пишем методы
    //  либо сначала пишем программу в целом, используя только
    //  заготовки методов


    System.out.println("Hello world!");
  }
}