//Создайте класс "Человек", конструктор которого принимает имя.
//
//При попытке вывести объект этого класса на экран должна выводиться строка "Человек по имени ...".
//
//Добавьте в класс "Человек" метод "приветствие", который будет выводить строку: "Я родился!"
//
//Создайте классы "Мужчина" и "Женщина", которые будут наследниками класса "Человек".
//
//Попытка вывести их на экран должна приводить к выводу строки "Мужчина по имени ..." или "Женщина по имени ..."
//
//Метод "приветствие" класса "Женщина" должен выводить строку: "Я родилась!"
public class Main {

  public static void main(String[] args) {

    Human human = new Human("Иван");
    System.out.println(human);

    Woman woman = new Woman("Анна");
    Man man = new Man("Василий");

    System.out.println(woman);
    System.out.println(man);

    human.greet();
    woman.greet();
    man.greet();
  }
}