package l_06_02;

import java.util.Scanner;

public class homework {
    public static void main(String[] args) {
      /*
        Задача 1 Вывести на экран таблицу квадратов натуральных чисел от 0 до 99
        Вид таблицы: https://ege-study.ru/tablica-kvadratov-naturalnyx-chisel-formuly-sokrashhennogo-umnozheniya/

   */

        /*
        - ничего у пользователя не спрашиваем
        - организуем построчный вывод таблицы
        -  в каждой строчке сначала печатаем цифру, а затем значения
        - квадратов (цикл от 0 до 9)
        - переход на новую строчку ( увеличить цифру на 1 )
        -  это повторять 10 раз (столько, сколько раз нужно вывести строчку)

         */
       /* for (int i = 0; i <= 99; i++) {
            int result = i * i;
            System.out.println(result);
        } */

    }

}

