import java.io.IOException;

public class car {
    // 1- есть строка. Написать программу, выводяшую на экран целое число, равное длине этой строки


    //  2 - Дана строка четной длины. написать программу,
    //  выводяшую на экран половину этой строки

    // 3 - Написать программу , переставляющую первую букву
    // в конец строки и вывести получившуюся строку в консоль,
    // abcd  bcda


    // 4 - Написать программу , переставляющую последнюю букву
    // в начало строки и вывести получившуюся строку в консоль,
    // abcd  dabc
    }
