package l_10_02;

public class HwChess {

  public static void main(String[] args) {
    //Задача 1. Завести двумерный масив "шахматная доска". Белый цвет - 0, черный цвет - 1.
    // Заполнить массив в соответствии с "шахматной доской" и вывести его на печать.
    // Начальная клетка доски А1 - в левом нижнем углу, черная.

    int chess[][] = {{0, 2, 3, 1, 0, 1, 0, 6}, {8, 0, 1, 0, 1, 0, 1, 0}, {0, 1, 0, 1, 0, 1, 0, 1},
        {1, 0, 1, 0, 1, 0, 1, 0}, {0, 1, 0, 1, 0, 1, 0, 1}, {1, 0, 1, 0, 1, 0, 1, 0},
        {0, 1, 0, 1, 0, 1, 0, 1},
        {1, 0, 1, 0, 1, 0, 1, 0}};

    for (int i = 0; i < 8; i++) { //stroka

      for (int j = 0; j < 8; j++) {   //stolbec
        System.out.print(chess[i][j] + " ");
      }
      System.out.println();
    }

  }

}
